merveillerose/Projet-Commande-Robot-par-gestes/hand detection with STM32N6/x-cube-n6-ai-hand-landmarks-main/Src/app.c
		   // calcule les positions en x et y moyenne des bouts de chaque doigt
		   float tips_y = (y[4] + y[8] + y[12] + y[16] + y[20]) / 5.0f;
		   float tips_x = (x[4] + x[8] + x[12] + x[16] + x[20]) / 5.0f;


		    // paume ouverte: stop, vers le bas: backward, vers l'avant: forward
		    // les +/- 100 permettent de donner plus d'espace de mouvement
		    //(pour ne pas devoir être extrèmement précis pour pouvoir avancer)
			if (tips_y < wrist_y - GESTURE_MARGIN) g = G_STOP;
			else if (tips_y > wrist_y + GESTURE_MARGIN) g = G_BACKWARD;
			else g= G_FORWARD;
			// l'inclinaison gauche/droite est choisie après le choix de déplacement pour qu'une main
			//inclinée à droite ne soit pas considérée comme un forward(on priorise le fait de tourner à
			// celui d'avancer)
			// de même ici les +/- 100 permmettent de ne pas toujours finir par obtenir left ou right
			//tant que la main est à peu près centrée
			if (tips_x < wrist_x - GESTURE_MARGIN) g = G_LEFT;
			else if (tips_x > wrist_x + GESTURE_MARGIN) g = G_RIGHT;
	  	  }
	  //pour stopper la détection, on maintient la position stop
	  if (g==G_STOP){
		  stop_count+=1;
	  }
	  else{
		  stop_count=0;
	  }
	  if (stop_count==200){
		  stop_count=0;
		  hand_recognition=0;
		  lock_state=1;
	  }
	  return g; }


void  gesture_start (hand_info_t *hand){
	   const int disk_radius = DISK_RADIUS;
	   roi_t *roi = &hand->roi;
	  //LD_LANDMARK_NB correspond au nb de points repères
	  int x[LD_LANDMARK_NB];
	  int y[LD_LANDMARK_NB];
	  int is_clamped[LD_LANDMARK_NB];
	  ld_point_t decoded;
	  int i;
	  for (i = 0; i < LD_LANDMARK_NB; i++) {
	    decode_ld_landmark(roi, &hand->ld_landmarks[i], &decoded);
	    // decode mets les coordonnées en x,y utilisable
	    x[i] = (int)decoded.x;
	    y[i] = (int)decoded.y;
	    // teste si le point x[i], y[i] est dans le cadre
	    is_clamped[i] = clamp_point_with_margin(&x[i], &y[i], disk_radius);
	  	  }
	  // pour débloquer la détection de mouvement, on observe uniquement l'index et la paume
	  // pour débloquer, il  faut faire passer l'index de gauche à droite de la paume( avec une marge
	  // pour ne pas débloquer par accident)
	  if (is_clamped[0]==0 && is_clamped[8]==0 ) {
		  if (hand_recognition==0){
			   if(x[8]<x[0] -GESTURE_MARGIN){
				   hand_recognition=1;
			   }
		   }
		   if (hand_recognition==1){
			   if(y[8]<y[0] - GESTURE_MARGIN){
				   hand_recognition=2;
		   			}
		   }
		   if (hand_recognition==2){
			   if(x[8]>x[0] + GESTURE_MARGIN){
				   hand_recognition=3;
		 		   lock_state=0;
		 		   			}
		 		   }
	  	 }
	  //si aucune main n'est détectée sur l'écran, on réinitialise le blocage
	  else{
		  hand_recognition=0;
	  }
}


void display_hand(display_info_t *info, hand_info_t *hand)
{
  if (info->is_pd_displayed) {
    display_pd_hand(&hand->pd_hands);
    display_roi(&hand->roi);
  }
  if (info->is_ld_displayed)
    display_ld_hand(hand);
}

static void Display_NetworkOutput(display_info_t *info)
{
  float cpu_load_one_second;
  int line_nb = 0;
  float nn_fps;
  int i;

  /* clear previous ui */
  UTIL_LCD_FillRect(lcd_fg_area.X0, lcd_fg_area.Y0, lcd_fg_area.XSize, lcd_fg_area.YSize, 0x00000000); /* Clear previous boxes */

  /* cpu load */
  cpuload_update(&cpu_load);
  cpuload_get_info(&cpu_load, NULL, &cpu_load_one_second, NULL);
  /* command */
  gesture_t gesture = classify_gesture(&disp.info.hands[0]);
  /* draw metrics */
  nn_fps = 1000.0 / info->nn_period_ms;
  // on ajoute l'affichage de l'état de l'écran à gauche
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), LEFT_MODE, "State");
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb),  RIGHT_MODE, "Cpu load");
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb),  RIGHT_MODE, "   %.1f%%", cpu_load_one_second);
  if (lock_state==0){
	UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_GREEN);
  	UTIL_LCDEx_PrintfAt(0, LINE(line_nb), LEFT_MODE, "unlocked");}
  if(lock_state==1){
	  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_RED);
  	UTIL_LCDEx_PrintfAt(0, LINE(line_nb), LEFT_MODE, "locked");
    }
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);
  line_nb += 2;
  // ainsi que la commande perçue si la détection est débloquée
  if (lock_state==0){
	  UTIL_LCDEx_PrintfAt(0, LINE(line_nb),  LEFT_MODE, "Command");}
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "Inferences");
  line_nb += 1;
  if (lock_state==0){
	  switch (gesture)
		{
		  case G_STOP:
			UTIL_LCDEx_PrintfAt(0, LINE(line_nb),  LEFT_MODE, "STOP");
			break;
		  case G_BACKWARD:
			UTIL_LCDEx_PrintfAt(0, LINE(line_nb),  LEFT_MODE, "BACKWARD");
			break;
		  case G_FORWARD:
			UTIL_LCDEx_PrintfAt(0, LINE(line_nb),  LEFT_MODE, "FORWARD");
			break;
		  case G_LEFT:
			UTIL_LCDEx_PrintfAt(0, LINE(line_nb),  LEFT_MODE, "LEFT");
			break;
		  case G_RIGHT:
			UTIL_LCDEx_PrintfAt(0, LINE(line_nb),  LEFT_MODE, "RIGHT");
			break;
		  default:
			UTIL_LCDEx_PrintfAt(0, LINE(line_nb),  LEFT_MODE, "NONE");
			break;

		}
  }
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, " pd %2ums", info->pd_ms);
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, " hl %2ums", info->hl_ms);
  line_nb += 2;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "  %.1f FPS", nn_fps);
  line_nb +=2;
  if (DBG_INFO) {
    UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "Display");
    line_nb += 1;
    UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "   %ums", info->disp_ms);
    line_nb += 1;
  }

  /* display palm detector output */
  for (i = 0; i < info->pd_hand_nb; i++) {
    if (info->hands[i].is_valid)
      display_hand(info, &info->hands[i]);
  }

  if (DBG_INFO)
    UTIL_LCDEx_PrintfAt(0, LINE(line_nb),  RIGHT_MODE, "pd : %5.1f %%", info->pd_max_prob * 100);
}

static void palm_detector_init(pd_model_info_t *info)
{
  const LL_Buffer_InfoTypeDef *nn_out_info = LL_ATON_Output_Buffers_Info_palm_detector();
  const LL_Buffer_InfoTypeDef *nn_in_info = LL_ATON_Input_Buffers_Info_palm_detector();
  int ret;

  /* model info */
  info->nn_in_len = LL_Buffer_len(&nn_in_info[0]);
  info->prob_out = (float *) LL_Buffer_addr_start(&nn_out_info[0]);
  info->prob_out_len = LL_Buffer_len(&nn_out_info[0]);
  assert(info->prob_out_len == AI_PD_MODEL_PP_TOTAL_DETECTIONS * sizeof(float));
  info->boxes_out = (float *) LL_Buffer_addr_start(&nn_out_info[1]);
  info->boxes_out_len = LL_Buffer_len(&nn_out_info[1]);
  assert(info->boxes_out_len == AI_PD_MODEL_PP_TOTAL_DETECTIONS * sizeof(float) * 18);

